using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace EducationEconomic
{
    public partial class akef4 : Form
    {
        public akef4()
        {
            InitializeComponent();
        }

        private void akef4_Load(object sender, EventArgs e)
        {
            comboBox1.SelectedItem = "Διαλέξτε Ενότητα";
        }

        private void button1_Click(object sender, EventArgs e)
        {
            akef3 akef353 = new akef3();
            akef353.Show(this);
            this.Hide();
        }

        private void button2_Click(object sender, EventArgs e)
        {
            akef5 akef3533 = new akef5();
            akef3533.Show(this);
            this.Hide();
        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            richTextBox1.SelectAll();
            richTextBox1.SelectionAlignment = HorizontalAlignment.Left;

            if (comboBox1.SelectedItem == "4.1 Η Ισορροπία της Αγοράς")
            {

                richTextBox1.Text = "Στο σημείο ισορροπίας μιας αγοράς η ποσότητα προϊόντος που είναι διατεθειμένοι να αγοράσουν οι καταναλωτές στην τιμή ισορροπίας (P1) είναι ίση με την ποσότητα που είναι διατεθειμένοι να προσφέρουν οι παραγωγοί (Q1). Αλγεβρικά το σημείο αυτό μπορεί να βρεθεί εξισώνοντας τις καμπύλες ζήτησης και προσφοράς.\n\nΌταν η τιμή του προϊόντος είναι μεγαλύτερη από την τιμή ισορροπίας (όπως η Ρ2), τότε η προσφερόμενη ποσότητα (Qs) είναι μεγαλύτερη από τη ζητούμενη (Qd) με αποτέλεσμα να δημιουργείται πλεόνασμα προϊόντος στην αγορά. Οι παραγωγοί βλέποντας τα αποθέματά τους να αυξάνονται θα μειώσουν την τιμή του προϊόντος μειώνοντας έτσι την προσφερόμενη ποσότητα, ενώ παράλληλα αυξάνεται η ζητούμενη ποσότητα, με αποτέλεσμα να επανέλθει η αγορά στο σημείο ισορροπίας. Ο αντίστροφος μηχανισμός θα ενεργοποιηθεί, όταν η τιμή είναι μικρότερη από την τιμή ισορροπίας προκαλώντας, έτσι, έλλειμμα στην αγορά. Το έλλειμμα αυτό θα εξαλειφθεί, όταν σταδιακά αυξηθεί η τιμή μέχρι να φτάσει στο σημείο ισορροπίας.";

            }

            else if (comboBox1.SelectedItem == "4.2 Οι Συνέπειες της Τέλειας Ανταγωνιστικής Αγοράς")
            {

                richTextBox1.Text = "Όταν όλες οι αγορές μιας οικονομίας είναι ανταγωνιστικές, ενδέχεται να διαμορφωθεί μια κατανομή των πόρων που είναι γνωστή ως κατά Pareto αποτελεσματική κατανομή. Η κατά Pareto αποτελεσματική κατανομή των πόρων είναι μια κατάσταση όπου δεν υπάρχει άλλη κατανομή των πόρων με την οποία θα βελτιωνόταν η θέση ενός ατόμου, χωρίς να επιδεινωθεί η θέση κάποιου άλλου. Σημειώνεται ότι μια αποτελεσματική κατανομή των πόρων δεν είναι (πάντα) και μια δίκαιη κατανομή.";


            }
            else if (comboBox1.SelectedItem == "4.3 Το Θεώρημα του Παρέτο")
            {

                richTextBox1.Text = "O Vilfredo Pareto γεννήθηκε το 1948 στο Παρίσι από γονείς Ιταλικής αριστοκρατικής καταγωγής. Παρακολούθησε κλασσικές σπουδές και μηχανική στο Πολυτεχνείο του Τορίνο, μελετώντας ιδιαίτερα το φαινόμενο της μηχανικής ισορροπίας. Η συνεισφορά του στην οικονομική επιστήμη εντοπίζεται, κυρίως, στα οικονομικά της ευημερίας. Αντιλήφθηκε την έννοια της χρησιμότητας (utility), όχι όπως χρησιμοποιείτο ευρέως, με την έννοια, δηλαδή, της ατομικής ή κοινωνικής ευημερίας, αλλά ως την οικονομική συμπεριφορά των ατόμων βάση του τι είναι επιθυμητό γι' αυτά και χρησιμοποιώντας κυρίως την έννοια της ωφέλειας (ophelimity).\n\nΣτο πλαίσιο των οικονομικών της ευημερίας  ανέπτυξε τα δύο θεωρήματα οικονομικής ευημερίας σύμφωνα με τα οποία:\n\nΜια κατανομή των πόρων είναι αποτελεσματική, όταν δεν υπάρχει άλλη κατανομή των πόρων που θα βελτίωνε τη θέση ενός ατόμου, χωρίς να επιδεινώσει τη θέση κάποιου άλλου (πρώτο θεώρημα οικονομικής ευημερίας).\n\nΜια αποτελεσματική κατανομή των πόρων μπορεί να επιτευχθεί μέσω ενός αποκεντρωμένου συστήματος τιμών και των συνθηκών του τέλειου ανταγωνισμού. Συνεπώς, κάθε ανταγωνιστική ισορροπία οδηγεί στην αποτελεσματική κατανομή των πόρων (δεύτερο θεώρημα οικονομικής ευημερίας).";


            }
            else if (comboBox1.SelectedItem == "4.4 Αποτυχίες της Αγοράς")
            {

                richTextBox1.Text = "Εκτός από τις μονοπωλιακές και ολιγοπωλιακές αγορές που προαναφέρθηκαν, υπάρχουν και άλλοι λόγοι για τους οποίους ο μηχανισμός της αγοράς αποτυγχάνει και συνεπώς απαιτείται η κρατική παρέμβαση.\n\nΑτελής και Ασύμμετρη Πληροφόρηση\n\nΥπάρχουν περιπτώσεις αγορών στις οποίες δεν υπάρχει τέλεια πληροφόρηση για την ποιότητα του προϊόντος (π.χ. οι αγορές ασφαλιστικών υπηρεσιών). Έτσι, ο μηχανισμός της αγοράς μέσω της διαμόρφωσης των τιμών αποτυγχάνει να κατανείμει αποτελεσματικά τους πόρους.\n\nΕξωτερικές Οικονομίες\n\nΕξωτερικές οικονομίες δημιουργούνται, όταν η συμπεριφορά ενός ατόμου ή μιας επιχείρησης προκαλεί κέρδος ή ζημιά σε κάποιον τρίτο (επιχείρηση ή άτομα) , χωρίς, όμως, να υπάρχει μηχανισμός της αγοράς που θα εσωτερικεύσει τις συνέπειες αυτές μέσω των τιμών. Κλασικό παράδειγμα είναι η μόλυνση του περιβάλλοντος.";


            }
            else if (comboBox1.SelectedItem == "4.5 Δημόσια Αγαθά")
            {

                richTextBox1.Text = "Τα δημόσια αγαθά έχουν δυο σημαντικές ιδιότητες: α) δεν αυξάνεται το κόστος παραγωγής, αν ένα επιπλέον άτομο καταναλώσει το αγαθό και β) είναι αδύνατον να αποκλειστεί κάποιο άτομο από την κατανάλωση του αγαθού. Η αγορά είτε αποτυγχάνει να προσφέρει αυτά τα αγαθά είτε τα προσφέρει σε ανεπαρκείς ποσότητες. Παράδειγμα τέτοιων αγορών είναι η εθνική άμυνα, η δημόσια ασφάλεια κ.α.Σε αυτές τις περιπτώσεις κρίνεται αναγκαία η παρέμβαση του κράτους στην αγορά. Ο μηχανισμός αποκάλυψης των προτιμήσεων των καταναλωτών για το βαθμό και το περιεχόμενο της κρατικής παρέμβασης  γίνεται μέσω της ψηφοφορίας.";


            }
        }

        private void akef4_FormClosing(object sender, FormClosingEventArgs e)
        {
            aode ae = new aode();
            ae.Show();
            this.Hide();
        }

        private void button2_MouseHover(object sender, EventArgs e)
        {
            toolTip1.Show("Έπόμενο Κεφάλαιο ", button2);
        }

        private void button1_MouseHover(object sender, EventArgs e)
        {
            toolTip2.Show("Προηγούμενο Κεφάλαιο ", button1);
        }
    }
}
