using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace EducationEconomic
{
    public partial class akef2 : Form
    {
        public akef2()
        {
            InitializeComponent();
        }

        private void button1_Click(object sender, EventArgs e)
        {
            akef1 ao = new akef1();
            ao.Show(this);
            this.Hide();
        }

        private void button2_Click(object sender, EventArgs e)
        {
            akef3 akef33 = new akef3();
            akef33.Show(this);
            this.Hide();
        }

        private void akef2_Load(object sender, EventArgs e)
        {
            comboBox1.SelectedItem = "Διαλέξτε Ενότητα";
        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            richTextBox1.SelectAll();
            richTextBox1.SelectionAlignment = HorizontalAlignment.Left;

            if (comboBox1.SelectedItem == "2.1 Η Συμπεριφορά των Επιχειρήσεων")
            {

                richTextBox1.Text = "Οι επιχειρήσεις χρησιμοποιούν παραγωγικούς συντελεστές -γη, κεφάλαιο, εργασία και επιχειρηματικότητα- για να παράγουν αγαθά και υπηρεσίες, τα οποία διαθέτουν μέσω του μηχανισμού της αγοράς. Στόχο έχουν την μεγιστοποίηση των κερδών τους.\n\nΣτη λήψη αποφάσεων των επιχειρήσεων σημαντικό ρόλο διαδραματίζει ο χρονικός ορίζοντας της επιχείρησης, τον οποίο μπορούμε να διακρίνουμε σε μακροχρόνια και βραχυχρόνια περίοδο. Μακροχρόνια περίοδος για μια επιχείρηση είναι αυτή κατά την οποία μπορεί να μεταβάλει το σύνολο των ποσοτήτων των παραγωγικών συντελεστών που χρησιμοποιεί. Βραχυχρόνια, είναι η περίοδος κατά την οποία η επιχείρηση δεν μπορεί να μεταβάλει την ποσότητα ενός τουλάχιστον παραγωγικού συντελεστή. Οι παραγωγικοί συντελεστές που μεταβάλλονται στη βραχυχρόνια περίοδο ονομάζονται μεταβλητοί και αυτοί που δεν μπορούν να μεταβληθούν σταθεροί.";

            }

            else if (comboBox1.SelectedItem == "2.2 Η Συνάρτηση Παραγωγής των Επιχειρήσεων")
            {

                richTextBox1.Text = "Αν Χ1, Χ2, ...Χν οι ποσότητες των παραγωγικών συντελεστών που χρησιμοποιεί μια επιχείρηση, η συνάρτηση παραγωγής τη βραχυχρόνια περίοδο θα είναι της μορφής:\n\ny =f(X1, X2,…,Xν)\n\nτη βραχυχρόνια περίοδο μπορούν να διακριθούν τα εξής μεγέθη ως προς την παραγωγή της επιχείρησης:\n\n1. Συνολικό Προϊόν (Total Product -ΤP ): δείχνει το συνολικό προϊόν που μπορεί να παραχθεί για κάθε ποσότητα του μεταβλητού παραγωγικού συντελεστή.\n\n2. Μέσο Προϊόν (Average Product-ΑΡ): δείχνει πόση ποσότητα προϊόντος παράγεται κατά μέσο όρο από κάθε μονάδα του μεταβλητού παραγωγικού συντελεστή. Υπολογίζεται ως εξής : ΑΡ=ΤΡ/Χ1.\n\n3. Οριακό Προϊόν (Marginal Product-ΜΡ): δείχνει πόσο θα μεταβληθεί το συνολικό προϊόν, αν μεταβληθεί η ποσότητα του μεταβλητού παραγωγικού συντελεστή κατά μία μονάδα. Υπολογίζεται ως εξής  ΜΡ=Δ(ΤΡ)/ΔΧ1.";


            }
            else if (comboBox1.SelectedItem == "2.3 Ο Νόμος της Φθίνουσας Απόδοσης")
            {

                richTextBox1.Text = "Κατά τη βραχυχρόνια περίοδο, ύστερα από ένα σημείο, οι διαδοχικές αυξήσεις στο μεταβλητό παραγωγικό συντελεστή δίνουν όλο και μικρότερες αυξήσεις στο Συνολικό Προϊόν. Αυτός είναι ο Νόμος της Φθίνουσας Απόδοσης και διαγραμματικά απεικονίζεται στο φθίνον τμήμα της καμπύλης του Οριακού Προϊόντος.";

            }
            else if (comboBox1.SelectedItem == "2.4 Μεταβολή Προσδιοριστικού Παράγοντα της Προσφοράς")
            {

                richTextBox1.Text = "Αν μεταβληθεί ένας από τους προσδιοριστικούς παράγοντες της προσφοράς, μετατοπίζεται παράλληλα ολόκληρη η καμπύλη προσφοράς. Οι προσδιοριστικοί παράγοντες της προσφοράς είναι:\n\n1. Η τεχνολογία παραγωγής  Όταν βελτιώνεται (χειροτερεύει) η τεχνολογία παραγωγής ενός προϊόντος, η καμπύλη προσφοράς μετατοπίζεται προς τα έξω και δεξιά (μέσα και αριστερά).\n\n2. Οι τιμές των παραγωγικών συντελεστών  Όταν μειώνονται (αυξάνονται) οι τιμές των παραγωγικών συντελεστών, η καμπύλη προσφοράς μετατοπίζεται προς τα έξω και δεξιά (μέσα και αριστερά).\n\n3. Οι καιρικές συνθήκες για τα αγροτικά, κυρίως, προϊόντα Όταν οι καιρικές συνθήκες είναι (μη) ευνοϊκές  για την παραγωγή ενός αγροτικού προϊόντος, η καμπύλη προσφοράς μετατοπίζεται προς τα έξω και δεξιά (μέσα και αριστερά).\n\n4. Ο αριθμός των επιχειρήσεων για την αγοραία καμπύλη προσφοράς  Όταν αυξάνεται (μειώνεται) ο αριθμός των επιχειρήσεων, η αγοραία καμπύλη προσφοράς μετατοπίζεται προς τα έξω και δεξιά (μέσα και αριστερά).";

            }
            else if (comboBox1.SelectedItem == "2.5 Ελαστικότητα Προσφοράς ως Προς την Τιμή")
            {

                richTextBox1.Text = "Για να μετρήσουμε πόσο ευαίσθητες είναι οι επιχειρήσεις σε μια μεταβολή της τιμής χρησιμοποιούμε την ελαστικότητα προσφοράς ως προς την τιμή, η οποία υπολογίζεται ως εξής:\n\nEs=DQs/Qs:DP/P.\n\nΗ ελαστικότητα προσφοράς λαμβάνει πάντα θετικές τιμές ως αποτέλεσμα του Νόμου της Προσφοράς.  Η προσφορά ενός προϊόντος μπορεί να είναι:\n\n1. Ελαστική όταν Es>1, όταν, δηλαδή, η ποσοστιαία μεταβολή της προσφερόμενης ποσότητας είναι μεγαλύτερη από την ποσοστιαία μεταβολή της τιμής.\n\n2. Ανελαστική όταν Es<1, όταν, δηλαδή, η ποσοστιαία μεταβολή της προσφερόμενης ποσότητας είναι μικρότερη από την ποσοστιαία μεταβολή της τιμής.\n\n3. Μοναδιαία όταν Es=1, όταν, δηλαδή, η ποσοστιαία μεταβολή της προσφερόμενης ποσότητας είναι ίση με την ποσοστιαία μεταβολή της τιμής.\n\n4. Πλήρως Ελαστική όταν Es=oo, όταν, δηλαδή, μια μικρή μεταβολή της τιμής οδηγεί σε πολύ μεγάλη μεταβολή της προσφερόμενης ποσότητας.\n\n5. Πλήρως Ανελαστική όταν Es=0, όταν, δηλαδή, η προσφερόμενη ποσότητα δεν μεταβάλλεται καθόλου σε μια μεταβολή της τιμής.\n\nΟι σπουδαιότεροι παράγοντες που προσδιορίζουν την ελαστικότητα προσφοράς είναι η περίοδος παραγωγής της επιχείρησης και η δυνατότητά της να προσαρμόσει το κόστος της στις μεταβολές της τιμής και το μέγεθος της επιχείρησης.";

            }
        }

        private void akef2_FormClosing(object sender, FormClosingEventArgs e)
        {
            aode ae = new aode();
            ae.Show();
            this.Hide();
        }

        private void button2_MouseHover(object sender, EventArgs e)
        {
            toolTip1.Show("Έπόμενο Κεφάλαιο ", button2);
        }

        private void button1_MouseHover(object sender, EventArgs e)
        {
            toolTip2.Show("Προηγούμενο Κεφάλαιο ", button1);
        }
    }
}
