using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace EducationEconomic
{
    public partial class akef1 : Form
    {
        public akef1()
        {
            InitializeComponent();
        }

        private void button1_Click(object sender, EventArgs e)
        {
            aode aode1 = new aode();
            aode1.Show(this);
            this.Hide();
        }

        private void button2_Click(object sender, EventArgs e)
        {
            akef2 akef22 = new akef2();
            akef22.Show(this);
            this.Hide();
        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            richTextBox1.SelectAll();
            richTextBox1.SelectionAlignment = HorizontalAlignment.Left;

            if (comboBox1.SelectedItem == "1.1  Εισαγωγικές Έννοιες")
            {

                richTextBox1.Text = "Αντικείμενο της Μικροοικονομικής ανάλυσης είναι η διαδικασία λήψεως αποφάσεων των οικονομικών μονάδων: καταναλωτών και επιχειρήσεων. Μεταξύ άλλων, εξετάζονται η κατανομή των πόρων και η διανομή του εισοδήματος μεταξύ των οικονομικών μονάδων.\n\nΑπό την πλευρά των καταναλωτών, εξετάζεται ποια προϊόντα θα επιλέξουν να καταναλώσουν, σε ποιες ποσότητες και πώς τελικά προκύπτει η καμπύλη ζήτησης.Από την πλευρά των επιχειρήσεων, εξετάζεται ποια ποσότητα προϊόντος θα προσφέρουν για κάθε τιμή και πώς προκύπτει η καμπύλη προσφοράς.Οι δυο πλευρές μέσω του μηχανισμού της αγοράς ανταλλάσσουν αγαθά και υπηρεσίες με χρήμα, που σε συνθήκες τέλειου ανταγωνισμού διαμορφώνονται η τιμή και η ποσότητα ισορροπίας.\n\nΕνώ από την μικροοικονομική θεωρία προκύπτουν χρήσιμα συμπεράσματα για την οικονομική επιστήμη γενικότερα, ωστόσο θα πρέπει να αποφεύγεται το λεγόμενο Σφάλμα Σύνθεσης, με άλλα λόγια δεν πρέπει τα συμπεράσματα της μακροοικονομικής ανάλυσης να ανάγονται στη μικροοικονομική θεωρία - ό,τι ισχύει για τα άτομα, δεν ισχύει για το σύνολο της οικονομίας.\n\nΣύμφωνα με την Μικροοικονομική ανάλυση, ως Ορθολογικός Καταναλωτής ορίζεται αυτός, ο οποίος με δεδομένο το εισόδημά του και τις τιμές των αγαθών, θα επιλέξει εκείνους τους συνδυασμούς αγαθών που μεγιστοποιούν τη χρησιμότητά του.";

            }

            else if (comboBox1.SelectedItem == "1.2 Η Διαμόρφωση των Προτιμήσεων του Καταναλωτή")
            {

                richTextBox1.Text = "Έστω δύο συνδυασμοί αγαθών Α(Χ1, Χ2) και Β(Χ1',Χ2')  μεταξύ των οποίων ο καταναλωτής καλείται να επιλέξει ποιος είναι προτιμότερος. Ο συνδυασμός Α μπορεί να είναι προτιμότερος του Β (Α > ή = Β), ο Β να είναι προτιμότερος του Α (Β > ή = Α) ή ο καταναλωτής να είναι αδιάφορος για τους δύο συνδυασμούς (Α~Β).\n\nΟι προτιμήσεις ενός ορθολογικού καταναλωτή βασίζονται στα εξής αξιώματα:\n\nΑ. Το Αξίωμα της Πληρότητας, σύμφωνα με το οποίο δυο συνδυασμοί αγαθών μπορούν να συγκριθούν μεταξύ τους.\n\nΒ. Το Αξίωμα της Ανακλαστικότητας, σύμφωνα με το οποίο ένας συνδυασμός είναι εξίσου καλός με τον εαυτό του.\n\nΓ. Το Αξίωμα της Μεταβατικότητας, σύμφωνα με το οποίο, όταν ένας συνδυασμός Α είναι προτιμότερος του Β και ο Β είναι προτιμότερος ενός άλλου συνδυασμού Γ, τότε και ο συνδυασμός Α θα είναι προτιμότερος του Γ.";


            }
            else if (comboBox1.SelectedItem == "1.3 Ο Εισοδηματικός Περιορισμός")
            {

                richTextBox1.Text = "Αν και οι καταναλωτές μπορεί να επιθυμούν την κατανάλωση όλο και μεγαλύτερων ποσοτήτων αγαθών, το περιορισμένο εισόδημά τους καθορίζει τους εφικτούς καταναλωτικούς συνδυασμούς. Ας υποθέσουμε ότι ο καταναλωτής έχει στη διάθεσή του ένα περιορισμένο εισόδημα m. Αν οι τιμές των Χ1 και Χ2, είναι Ρ1 και Ρ2 αντίστοιχα, τότε θα πρέπει να ισχύει η εξής σχέση:\n\nm > ή = P1*X1+P2*X2.\n\nΜάλιστα, αν καταναλώνει το σύνολο του εισοδήματός του, η παραπάνω σχέση θα πάρει τη μορφή:\n\nm=P1*X1+P2*X2 => Χ2=m/P2-P1/P2*X1 (3)\n\nΗ εξίσωση 3, δείχνει ποια ποσότητα του αγαθού Χ2 μπορεί να καταναλώσει ένας ορθολογικός καταναλωτής για κάθε δεδομένη ποσότητα του αγαθού Χ1 με δεδομένες τις τιμές τους και το εισόδημά του. Η αρνητική κλίση του εισοδηματικού περιορισμού προκύπτει από το γεγονός ότι το εισόδημά του είναι περιορισμένο, με αποτέλεσμα όταν αυξάνει την κατανάλωση του ενός αγαθού να μειώνει την κατανάλωση του άλλου σε αναλογία -P1/P2.";

            }
            else if (comboBox1.SelectedItem == "1.4 Ο Νόμος της Ζήτησης και η Καμπύλη Ζήτησης")
            {

                richTextBox1.Text = "Σύμφωνα με το Νόμο της Ζήτησης, όταν μειώνεται η τιμή ενός αγαθού, αυξάνεται η ζητούμενη ποσότητά του και το αντίστροφο με τους προσδιοριστικούς παράγοντες της ζήτησης σταθερούς (ceteris paribus). Ο νόμος αυτός απεικονίζεται με μια ευθεία αρνητικής κλίσης. Στον κάθετο άξονα μετράμε την τιμή του αγαθού και στον οριζόντιο τη ζητούμενη ποσότητα. Η αλγεβρική του μορφή είναι:\n\nQd=a-bP, με b>0,\n\nΌπου Qd η ζητούμενη ποσότητα και P η τιμή.\n\nΑν αλλάξει κάποιος προσδιοριστικός παράγοντας της ζήτησης, τότε η καμπύλη ζήτησης μετατοπίζεται, ενώ μεταβάλλεται η ζήτηση και όχι η ζητούμενη ποσότητα. Οι προσδιοριστικοί παράγοντες της ζήτησης είναι οι εξής:\n\n1. Το εισόδημα των καταναλωτών: Όταν το αγαθό είναι κανονικό, μια αύξηση (μείωση) του εισοδήματος μετατοπίζει την καμπύλη ζήτησης προς τα έξω και δεξιά (μέσα και αριστερά).\n\n2. Οι τιμές των άλλων αγαθών  (συμπληρωματικά και υποκατάστατα). Συμπληρωματικά είναι δυο αγαθά, όταν η κατανάλωση του ενός συνεπάγεται και κατανάλωση του άλλου, ενώ υποκατάστατα όταν μπορούν να ικανοποιήσουν σχεδόν την ίδια ανάγκη. Η μείωση (αύξηση) της τιμής ενός συμπληρωματικού αγαθού μετατοπίζει προς τα έξω και δεξιά (μέσα και αριστερά) την καμπύλη ζήτησης του αγαθού. Η αύξηση (μείωση) της τιμής ενός υποκατάστατου μετατοπίζει προς τα έξω και δεξιά (μέσα και αριστερά) την καμπύλη ζήτησης του αγαθού.\n\n3. Οι προσδοκίες των καταναλωτών για την μελλοντική εξέλιξη του εισοδήματός τους ή των τιμών των αγαθών. Όταν αναμένουν μία μελλοντική αύξηση (μείωση) του εισοδήματός τους ή της τιμής του αγαθού, η καμπύλη ζήτησης μετατοπίζεται προς τα έξω και δεξιά (μέσα και αριστερά).\n\n4. Οι προτιμήσεις των καταναλωτών  'Αν μεταβληθούν (μη) ευνοϊκά για το αγαθό, θα μετατοπίσουν την καμπύλη ζήτησης προς τα έξω και δεξιά (μέσα και αριστερά).\n\n5. Ο αριθμός των καταναλωτών (για την αγοραία καμπύλη ζήτησης). Αν αυξηθεί (μειωθεί) ο αριθμός των καταναλωτών, θα μετατοπιστεί η αγοραία καμπύλη ζήτησης προς τα έξω και δεξιά (μέσα και αριστερά).";

            }
            else if (comboBox1.SelectedItem == "1.5 Η Ελαστικότητα Ζήτησης ως Προς την Τιμή")
            {

                richTextBox1.Text = "Πολλές φορές, είναι χρήσιμο να γνωρίζουμε πόσο ευαίσθητοι είναι οι καταναλωτές σε μια μεταβολή της τιμής. Δηλαδή, αν αυξηθεί κατά ένα ποσοστό η τιμή ενός αγαθού, πόσο θα μειωθεί η ζητούμενη ποσότητά του (και το αντίστροφο). Αυτό μας το δείχνει η ελαστικότητα ζήτησης ως προς την τιμή.  Η ποσοστιαία μεταβολή, δηλαδή, της ζητούμενης ποσότητας προς την ποσοστιαία μεταβολή της τιμής.\n\nEd=DQ/Q:DP/P\n\nΕπειδή η ελαστικότητα ζήτησης ως προς την τιμή είναι πάντα αρνητική, είναι πιο χρήσιμος ο υπολογισμός της σε απόλυτες τιμές και η σύγκρισή της με τη μονάδα:\n\n1. Αν |Ed|>1, τότε την ονομάζουμε ελαστική και η ποσοστιαία μεταβολή της ζητούμενης ποσότητας είναι μεγαλύτερη από την ποσοστιαία μεταβολή της τιμής.\n\n2. Αν |Ed|<1, τότε την ονομάζουμε ανελαστική και η ποσοστιαία μεταβολή της ζητούμενης ποσότητας είναι μικρότερη από την ποσοστιαία μεταβολή της τιμής.\n\n3. Αν |Ed|=1, τότε την ονομάζουμε μοναδιαία και η ποσοστιαία μεταβολή της ζητούμενης ποσότητας είναι ίση με την ποσοστιαία μεταβολή της τιμής.\n\n4. Αν |Ed|=0, τότε την ονομάζουμε πλήρως ανελαστική.\n\n5. Αν |Ed|=oo, τότε την ονομάζουμε πλήρως ελαστική.\n\n";

            }
        }

        private void akef1_Load(object sender, EventArgs e)
        {
            comboBox1.SelectedItem = "Διαλέξτε Ενότητα";
        }

        private void akef1_FormClosing(object sender, FormClosingEventArgs e)
        {
            aode ae = new aode();
            ae.Show();
            this.Hide();
        }

        private void button2_MouseHover(object sender, EventArgs e)
        {
            toolTip1.Show("Έπόμενο Κεφάλαιο ", button2);
        }

        private void button1_MouseHover(object sender, EventArgs e)
        {
            toolTip2.Show("Προηγούμενο Κεφάλαιο ", button1);
        }
    }
}
