using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace EducationEconomic
{
    public partial class akef3 : Form
    {
        public akef3()
        {
            InitializeComponent();
        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            richTextBox1.SelectAll();
            richTextBox1.SelectionAlignment = HorizontalAlignment.Left;

            if (comboBox1.SelectedItem == "3.1 Μορφές Αγοράς")
            {

                richTextBox1.Text = "Η μορφή αγοράς εντός της οποίας λειτουργεί μια επιχείρηση θα καθορίσει τις αποφάσεις της σχετικά με την ποσότητα και την τιμή του προϊόντος που θα προσφέρει. Οι μορφές αγοράς είναι:\n\n•Ο τέλειος Ανταγωνισμός\n•Το Μονοπώλιο\n•Το Ολιγοπώλιο\n•Ο Μονοπωλιακός Ανταγωνισμός";

            }

            else if (comboBox1.SelectedItem == "3.2 Ο Τέλειος Ανταγωνισμός")
            {

                richTextBox1.Text = "Τα βασικά χαρακτηριστικά μιας τέλεια ανταγωνιστικής αγοράς είναι τα εξής:\n\n1. Ο μεγάλος αριθμός επιχειρήσεων που παράγουν το ίδιο ομοιογενές προϊόν.\n2. Οι επιχειρήσεις προσπαθούν να μεγιστοποιήσουν τα κέρδη τους\n3. Οι επιχειρήσεις είναι λήπτες τιμής καθώς δεν μπορούν να την επηρεάσουν\n4. Η τέλεια πληροφόρηση\n5. Οι συναλλαγές χωρίς κόστος\nΜε δεδομένα τα παραπάνω, ας δούμε ποια ποσότητα προϊόντος θα επιλέξει να παράγει μια επιχείρηση σε έναν τέλεια ανταγωνιστικό κλάδο. Όταν μια επιχείρηση πουλήσει μια επιπλέον μονάδα προϊόντος, τα έσοδα από την πώληση της επιπλέον μονάδας είναι το Οριακό Έσοδο (MR). Το οριακό έσοδο δεν είναι τίποτα άλλο από την τιμή πώλησης της τελευταίας μονάδας προϊόντος. Η παραγωγή αυτής της επιπλέον μονάδας θα κοστίσει στην επιχείρηση το Οριακό της Κόστος. Αν το οριακό κόστος της τελευταίας μονάδας που θα παράγει η επιχείρηση είναι μικρότερο από το οριακό έσοδο που θα εισπράξει από την πώλησή της, τότε θα αυξήσει την παραγωγή. Αν το οριακό κόστος της τελευταίας μονάδας που θα παράγει η επιχείρηση είναι μεγαλύτερο από το οριακό έσοδο που θα εισπράξει από την πώλησή της, τότε θα μειώσει την παραγωγή της. Συνεπώς, μια ανταγωνιστική επιχείρηση θα επιλέξει να παράγει εκείνη την ποσότητα προϊόντος που το οριακό της έσοδο είναι ίσο με το οριακό κόστος. Σε έναν τέλεια ανταγωνιστικό κλάδο, όμως, η τιμή για κάθε επιχείρηση είναι δεδομένη και ίδια. Άρα λοιπόν μια επιχείρηση σε έναν τέλεια ανταγωνιστικό κλάδο θα επιλέξει να προσφέρει εκείνη την ποσότητα προίόντος που το οριακό της κόστος είναι ίσο με την τιμή του προϊόντος (P).\n\nΜC=MR=P\n\nΓια να μπορεί μια επιχείρηση να παράγει θα πρέπει τουλάχιστον να καλύπτει με τα συνολικά της έσοδα το κόστος παραγωγής όλων των προηγούμενων μονάδων. Συνεπώς η καμπύλη προσφοράς μια επιχείρησης τη βραχυχρόνια περίοδο είναι το ανερχόμενο τμήμα της καμπύλης του οριακού κόστους που βρίσκεται πάνω από την καμπύλη του μέσου μεταβλητού κόστους.";


            }
            else if (comboBox1.SelectedItem == "3.3 Το Μονοπώλιο")
            {

                richTextBox1.Text = "Σε μια μονοπωλιακή αγορά υπάρχει μια μόνο επιχείρηση που προσφέρει το προϊόν, η οποία επιλέγει να παράγει σε οποιοδήποτε σημείο πάνω στην αγοραία καμπύλη ζήτησης. Οι λόγοι δημιουργίας μονοπωλιακών κλάδων είναι είτε η ύπαρξη τεχνικών και νομικών εμποδίων εισόδου νέων επιχειρήσεων στον κλάδο είτε η ύπαρξη φυσικών μονοπωλίων. Τεχνικά εμπόδια αντιμετωπίζει μια επιχείρηση, όταν για την είσοδό της σε έναν κλάδο απαιτείται εξαιρετικά μεγάλης κλίμακας παραγωγή για να είναι η επιχείρηση επικερδής, δηλαδή, όταν η παραγωγή του προϊόντος χαρακτηρίζεται από οικονομίες κλίμακας. Νομικά εμπόδια εισόδου μπορεί να θέσει μια κυβέρνηση προκειμένου να προστατεύσει δικαιώματα ευρεσιτεχνίας και καινοτομιών για ένα χρονικό διάστημα. Επίσης, μονοπωλιακή συμπεριφορά παρατηρείται, όταν μικρός αριθμός επιχειρήσεων συμπράττουν μεταξύ τους και συστήνουν καρτέλ.\n\nΗ συνθήκη μεγιστοποίησης κερδών του μονοπωλητή είναι η εξίσωση του οριακού εσόδου με το οριακό κόστος της τελευταίας μονάδας προϊόντος. Όταν ο μονοπωλητής αυξάνει την προσφερόμενη ποσότητα, η τιμή του προϊόντος στην αγορά θα μειώνεται. Συνεπώς, η σχέση που συνδέει το οριακό έσοδο του μονοπωλητή και την προσφερόμενη ποσότητα είναι αρνητική. Ο μονοπωλητής προσφέρει στην αγορά μικρότερη ποσότητα προϊόντος σε σχέση με τον τέλειο ανταγωνισμό, με αποτέλεσμα η τιμή κάθε μονάδας προίόντος να είναι υψηλότερη σε σχέση με την τιμή του προίόντος σε μια ανταγωνιστική αγορά. Το γεγονός ότι ο μονοπωλητής προσφέρει μικρότερη ποσότητα προϊόντος και σε υψηλότερη τιμή σε σχέση με την αγοραία προσφορά μιας ανταγωνιστικής αγοράς έχει ως αποτέλεσμα απώλεια ευημερίας για το σύνολο της κοινωνίας.";

            }
            else if (comboBox1.SelectedItem == "3.4 Το Ολιγοπώλιο")
            {

                richTextBox1.Text = "Ολιγοπώλιο σχηματίζεται, όταν ο αριθμός επιχειρήσεων στην αγορά είναι τέτοιος, ώστε κάθε επιχείρηση μεμονωμένα να έχει τη δυνατότητα να επιδρά πάνω στην συνολικά προσφερόμενη ποσότητα, άρα και στην τιμή. Βασικό χαρακτηριστικό του ολιγοπωλίου είναι ότι οι ενέργειες μιας επιχείρησης έχουν επίδραση στην συμπεριφορά των άλλων επιχειρήσεων. Τα υποδείγματα που μελετούν την συμπεριφορά των ολιγοπωλιακών επιχειρήσεων διακρίνονται σε τρεις κατηγορίες: α) τα υποδείγματα ακολουθίας (υπάρχει ένας ηγέτης και ένας ακόλουθος στον ορισμό της τιμής και της ποσότητας), β) τα υποδείγματα ταυτόχρονου ορισμού τιμής και ποσότητας και γ) τα υποδείγματα της σύμπραξης (οι επιχειρήσεις σχηματίζουν ένα καρτέλ).\n\nΗ συνολική προσφερόμενη ποσότητα του προϊόντος ενός ολιγοπωλιακού κλάδου είναι μικρότερη από αυτήν που προσφέρεται σε συνθήκες τέλειου ανταγωνισμού. Συνεπώς, η τιμή που διαμορφώνεται στην αγορά είναι υψηλότερη σε σχέση με τον τέλειο ανταγωνισμό. Η τιμή παύει να είναι μέσο ανταγωνισμού μεταξύ των επιχειρήσεων, οι οποίες επικεντρώνονται πλέον σε μεθόδους διαφοροποίησης και προώθησης του προϊόντος.";

            }
            else if (comboBox1.SelectedItem == "3.5 Ο Μονοπωλιακός Ανταγωνισμός")
            {

                richTextBox1.Text = "Η δομή του μονοπωλιακού ανταγωνισμού μοιάζει με αυτήν του τέλειου ανταγωνισμού. Υπάρχει μεγάλος αριθμός επιχειρήσεων στον κλάδο και ελευθερία εισόδου και εξόδου των επιχειρήσεων. Στο μονοπωλιακό ανταγωνισμό η επιχείρηση αντιμετωπίζει φθίνουσα καμπύλη ζήτησης, άρα οι παραγωγοί δρουν ως μονοπωλητές υπό την έννοια ότι μπορούν να ορίσουν ως ένα βαθμό την τιμή του προϊόντος τους και να μην την δέχονται παθητικά όπως στον τέλειο ανταγωνισμό. Η δυνατότητα αυτή προκύπτει από το γεγονός ότι παράγουν διαφοροποιημένα προϊόντα και όχι τέλεια υποκατάστατα. Παρόλα αυτά ο ανταγωνισμός μεταξύ των επιχειρήσεων υφίσταται υπό την έννοια ότι τα προϊόντα που παράγονται είναι σε ένα βαθμό υποκατάστατα και συνεπώς τίθενται κάποια όρια στη συμπεριφορά κάθε επιχείρησης.\n\nΈστω ότι υπάρχει ένας κλάδος με μικρό αριθμό επιχειρήσεων, οι οποίες παράγουν διαφοροποιημένα προϊόντα. Κάθε επιχείρηση θα βλέπει τις πωλήσεις της να αυξάνονται όσο αυξάνεται η ζήτηση για τον κλάδο συνολικά και όσο αυξάνεται η τιμή στην οποία πωλούν οι ανταγωνιστές της. Αν αυξηθούν οι επιχειρήσεις στον κλάδο ή αν η επιχείρηση αυξήσει την τιμή του προϊόντος, οι πωλήσεις της μειώνονται.\n\nΕπιπλέον, θα μπορούσαμε να πούμε ότι όσο αυξάνεται ο αριθμός των επιχειρήσεων του κλάδου, τόσο αυξάνεται και το μέσο κόστος της κάθε επιχείρησης, αφού θα μειώνεται ο όγκος παραγωγής της και δεν θα δημιουργούνται οι ίδιες οικονομίες κλίμακας. Η αύξηση του αριθμού των επιχειρήσεων θα οξύνει το μεταξύ τους ανταγωνισμό, με αποτέλεσμα να μειώνεται η τιμή που μπορεί κάθε επιχείρηση να πωλήσει το προϊόν της. Επίσης, αν η τιμή του προϊόντος είναι μεγαλύτερη από το μέσο κόστος, τότε νέες επιχειρήσεις θα εισχωρήσουν στον κλάδο, ενώ αν η τιμή του προϊόντος υπολείπεται του μέσου κόστους, τότε επιχειρήσεις θα εξέλθουν από την παραγωγή.";

            }
        }

        private void akef3_Load(object sender, EventArgs e)
        {
            comboBox1.SelectedItem = "Διαλέξτε Ενότητα";
        }

        private void button1_Click(object sender, EventArgs e)
        {
            akef2 akef323 = new akef2();
            akef323.Show(this);
            this.Hide();
        }

        private void button2_Click(object sender, EventArgs e)
        {
            akef4 akef343 = new akef4();
            akef343.Show(this);
            this.Hide();
        }

        private void akef3_FormClosing(object sender, FormClosingEventArgs e)
        {
            aode ae = new aode();
            ae.Show();
            this.Hide();
        }

        private void button2_MouseHover(object sender, EventArgs e)
        {
            toolTip1.Show("Έπόμενο Κεφάλαιο ", button2);
        }

        private void button1_MouseHover(object sender, EventArgs e)
        {
            toolTip2.Show("Προηγούμενο Κεφάλαιο ", button1);
        }
    }
}
