using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace EducationEconomic
{
    public partial class kef5 : Form
    {
        public kef5()
        {
            InitializeComponent();
        }

        private void kef5_Load(object sender, EventArgs e)
        {
            comboBox1.SelectedItem = "Διαλέξτε Ενότητα";
        }

        private void button1_Click(object sender, EventArgs e)
        {
            kef4 kfs = new kef4();
            kfs.Show(this);
            this.Hide();
        }

        private void button2_Click(object sender, EventArgs e)
        {
            aoth kfss = new aoth();
            kfss.Show(this);
            this.Hide();
            MessageBox.Show("ΤΕΛΟΣ ΕΚΜΑΘΗΣΗΣ");
        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            richTextBox1.SelectAll();
            richTextBox1.SelectionAlignment = HorizontalAlignment.Left;

            if (comboBox1.SelectedItem == "5.1 Εισαγωγή")
            {

                richTextBox1.Text = "• Στη Γενική Θεωρία, ο Keynes υποστηρίζει ότι: – Το συνολικό προϊόν μιας οικονομίας καθορίζεται, στη βραχυχρόνια περίοδο, από την επιθυμία των νοικοκυριών, των επιχειρήσεων και του κράτους για δαπάνες. • Το πρόβλημα, λοιπόν, στη διάρκεια των οικονομικών υφέσεων, κατά τον Keynes είναι η ανεπάρκεια της δαπάνης.";

            }

            else if (comboBox1.SelectedItem == "5.2 Διάκριση Δαπανών")
            {

                richTextBox1.Text = "• Διακρίνουμε τη δαπάνη σε: 1. Πραγματική δαπάνη (Υ) – Είναι το ποσό που τα νοικοκυριά, οι επιχειρήσεις και το κράτος δαπανούν σε αγαθά και υπηρεσίες, και το οποίο είναι ίσο με το Α.Ε.Π. της οικονομίας. 2. Προγραμματισμένη δαπάνη (Ε) – Είναι το ποσό που τα νοικοκυριά, οι επιχειρήσεις και το κράτος θα ήθελαν να δαπανήσουν σε αγαθά και υπηρεσίες. • Υποθέτοντας ότι η οικονομία είναι κλειστή, ισχύει ότι: Ε=C+I+G όπου C η κατανάλωση, Ι η προγραμματισμένη επένδυση και G oι δημόσιες δαπάνες. • Η κατανάλωση είναι συνάρτηση του διαθέσιμου εισοδήματος, δηλαδή, C=C(Y-T) όπου Τ το ύψος των φόρων, το οποίο θεωρείται σταθερό. • Η προγραμματισμένη επένδυση είναι εξωγενώς σταθερή. • Το επίπεδο των κρατικών δαπανών είναι σταθερό και καθορισμένο. • Συνδυάζοντας όλα αυτά, ισχύει ότι: • Η εξίσωση αυτή μας λέει ότι η προγραμματισμένη δαπάνη είναι συνάρτηση: – του προϊόντος, – της προγραμματισμένης επένδυσης, και – των μεταβλητών της δημοσιονομικής πολιτικής (δημόσιες δαπάνες, φόροι). • Η οικονομία βρίσκεται σε ισορροπία όταν η πραγματική δαπάνη είναι ίση με τη προγραμματισμένη δαπάνη, δηλαδή, Υ=Ε • Αυτή η συνθήκη απεικονίζεται με μια γραμμή των 45ο . • Η ισορροπία της οικονομίας επιτυγχάνεται στο σημείο όπου η συνάρτηση της προγραμματισμένης δαπάνης (Ε) τέμνει τη γραμμή των 45ο .\n\n• Όταν η οικονομία δεν είναι σε θέση ισορροπίας, οι επιχειρήσεις γνωρίζουν μηπρογραμματισμένες μεταβολές στα αποθέματά τους. – Αυτό τους προτρέπει να μεταβάλλουν το επίπεδο παραγωγής τους. • Οι μεταβολές αυτές επηρεάζουν με τη σειρά τους, το συνολικό προϊόν και τη δαπάνη, κινώντας την οικονομία προς την ισορροπία.\n\n• Όταν το προϊόν ισορροπίας είναι μεγαλύτερο από το Y, έχουμε ότι: – Οι επιχειρήσεις παράγουν περισσότερα από όσα πωλούν (υπερβάλλουσα προσφορά). – Η κατάσταση αυτή δεν μπορεί να συνεχιστεί και έτσι οι επιχειρήσεις θα μειώσουν την παραγωγή τους. – Αυτό θα συνεχιστεί μέχρις ότου το προϊόν μειωθεί στο επίπεδο ισορροπίας.";


            }
            else if (comboBox1.SelectedItem == "5.3 Σύνοψη")
            {

                richTextBox1.Text = "• Συνοψίζοντας, ο κεϋνσιανός σταυρός δείχνει πώς καθορίζεται το προϊόν (Υ), για δεδομένα επίπεδα προγραμματισμένης επένδυσης (Ι) και δημοσιονομικής πολιτικής (G, T). • Αλλά, πώς μεταβάλλεται το προϊόν (Υ), όταν μεταβάλλεται κάποια από αυτές τις εξωγενείς μεταβλητές;";

            }
            else if (comboBox1.SelectedItem == "5.4. Η Αγορά Προϊόντων και η Καμπύλη IS")
            {

                richTextBox1.Text = "• Η καμπύλη IS απεικονίζει τη σχέση μεταξύ επιτοκίου (r) και προϊόντος (Y) που διαμορφώνεται στην αγορά αγαθών και υπηρεσιών. • Για να κατανοήσουμε αυτήν τη σχέση, θα ξεκινήσουμε με το βασικό υπόδειγμα που αποκαλείται κεϋνσιανός σταυρός. – Είναι η απλούστερη ερμηνεία της θεωρίας του Keynes.";

            }
            else if (comboBox1.SelectedItem == "5.5 Συμπεράσματα")
            {

                richTextBox1.Text = "• Οι κλασικοί υποστηρίζουν ότι: – Οι διαταραχές της συναθροιστικής ζήτησης έχουν μόνο πολύ βραχυχρόνιες επιπτώσεις σε πραγματικές μεταβλητές, όπως το προϊόν. – Δίνουν έμφαση στις διαταραχές της συναθροιστικής προσφοράς για την εξήγηση των οικονομικών κύκλων. – Ο ρόλος του κράτους για την αντιμετώπιση των οικονομικών κύκλων είναι περιορισμένος.\n\n• Οι κεϋνσιανοί υποστηρίζουν ότι: – Οι διαταραχές της συναθροιστικής ζήτησης μπορούν να επηρεάσουν το προϊόν για αρκετά μεγάλο χρονικό διάστημα. – Η οικονομική πολιτική μπορεί να βοηθήσει στην επιτάχυνση της επιστροφής της οικονομίας στην πλήρη απασχόληση.";

            }
        }

        private void kef5_FormClosing(object sender, FormClosingEventArgs e)
        {
            aoth ffoe = new aoth();
            ffoe.Show();
            this.Hide();
        }

        private void button2_MouseHover(object sender, EventArgs e)
        {
            toolTip1.Show("Έπόμενο Κεφάλαιο ", button2);
        }

        private void button1_MouseHover(object sender, EventArgs e)
        {
            toolTip2.Show("Προηγούμενο Κεφάλαιο ", button1);
        }
    }
}
